taskt/Core/Automation/Commands/DateTimeGroup/CalculateDateTimeFromTextCommand.dot
digraph "CalculateDateTimeFromTextCommand" {
"CalculateDateTimeFromTextCommand" -> "ACalculateDateTimeCommands";
"ACalculateDateTimeCommands" -> "ADateTimeConvertCommands";
"ACalculateDateTimeCommands" -> "IDateTimeResultProperties";
"ADateTimeConvertCommands" -> "ScriptCommand";
"ADateTimeConvertCommands" -> "IDateTimeConvertProperties";
"ScriptCommand" -> "IUIParameterProperties";
"ScriptCommand" -> "ICommandIDProperties";
}
