taskt/Core/Automation/Commands/DateTimeGroup/CalculateDateTimeFromTextCommand.puml
@startuml
CalculateDateTimeFromTextCommand --> ACalculateDateTimeCommands
ACalculateDateTimeCommands --> ADateTimeConvertCommands
ACalculateDateTimeCommands --> IDateTimeResultProperties
ADateTimeConvertCommands --> ScriptCommand
ADateTimeConvertCommands --> IDateTimeConvertProperties
ScriptCommand --> IUIParameterProperties
ScriptCommand --> ICommandIDProperties
@enduml
